subjects = {"Math": ["Математика", 27], "Infa": ["Информатика и ИКТ", 44], "Russian": ["Русский язык", 40],
            "Geography": ["География", 40], "PE": ["Физ. подготовка", 40], "Chemistry": ["Химия", 39],
            "Foreingh": ["Иностранный язык", 30], "Obschestvo": ["Обществознание", 45],
            "History": ["История", 35], "Physic": ["Физика", 39]}
rus_subj = {"мат": [27, "Математика"], "физ": [39, "Физика"], "хим": [39, "Химия"], "общ": [45, "Обществознание"],
            "рус": [40, "Русский язык"], "ино": [30, "Иностранный язык"], "анг": [30, "Иностранный язык"],
            "инф": [44, "Информатика и ИКТ"], "икт": [44, "Информатика и ИКТ"],
            "иии": [44, "Информатика и ИКТ"], "ист": [35, "История"], "гео": [40, "География"]}
eng_subj = {"Математика": "Math", "Информатика": "Infa", "Информатика и ИКТ": "Infa", "Русский": "Russian", "Русский язык": "Russian", "География": "Geography",
            "Химия": "Chemistry", "Иностранный": "Foreingh", "Иностранный язык": "Foreingh", "Обществознание": "Obschestvo",
            "История": "History", "Физика": "Physic"}

years = {"year_2021": "2021", "year_2022": "2022", "year_2023": "2023"}

facultets = ["Факультет геологии и геофизики нефти и газа",
            "Факультет разработки нефтяных и газовых месторождений",
            "Факультет проектирования, сооружения и эксплуатации систем трубопроводного транспорта",
            "Факультет инженерной механики",
            "Факультет химической технологии и экологии",
            "Факультет автоматики и вычислительной техники",
            "Факультет комплексной безопасности топливно-энергетического комплекса",
            "Факультет экономики и управления",
            "Факультет международного энергетического бизнеса",
            "Юридический факультет",
            "Я расставил проиритеты",
            "назад", "отмена"]

jobs_dict = {"05.03.01 Геология": {"нефтяник": 0.7, "геолог": 1, "геофизик": 1, "физик": 0.4, "разведчик": 0.8, "гидрогеолог": 1, "инженер": 0.4, "исследователь": 0.55},
        "05.03.06 Экология и природопользование": {"нефтяник": 0.7, "эколог": 0.8, "геоэколог": 1, "биолог": 0.35, "геолог": 0.4},
        "21.03.01 Нефтегазовое дело": {"нефтяник": 1, "инженер": 0.7, "технолог": 0.5, "инженер-технолог": 1, "специалист": 0.4, "менеджер": 0.1, "бурильщик": 0.8, "оператор": 0.5, "помощник": 0.3, "конструктор": 0.3, "исследователь": 0.2, "мастер": 0.45, "руководитель": 0.4, "геолог": 0.15, "ремонтник": 0.7},
        "15.03.01 Машиностроение": {"нефтяник": 0.55, "механик": 0.6, "сварщик": 1, "конструктор": 0.9, "инженер": 0.9, "технолог": 0.5, "специалист": 0.4, "мастер": 0.45, "руководитель": 0.4, "помощник": 0.3, "инженер-конструктор": 0.7},
        "15.03.02 Технологические машины и оборудование": {"нефтяник": 0.55, "инженер": 0.45, "оператор": 0.9, "руководитель": 0.4, "менеджер": 0.1, "бурильщик": 0.5, "конструктор": 0.5, "мастер": 0.4, "помощник": 0.3, "сотрудник": 0.2, "ученый": 0.3, "учёный": 0.3, "научный": 0.1, "исследователь": 0.15, "инженер-исследователь": 0.7, "инженер-конструктор": 0.7, "разработчик проектов": 0.7, "разработчик": 0.45, "технолог": 0.5},
        "27.03.01 Стандартизация и метрология": {"нефтяник": 0.55, "механик": 0.6, "аналитик": 0.9, "организатор": 0.6, "контролёр": 0.5, "контролер": 0.5, "разработчикк": 0.2, "измеритель": 0.9, "оценщик": 0.6},
        "20.03.01 Техносферная безопасность": {"инженер-исследователь": 0.8, "механик": 0.6, "инженер": 0.6, "исследователь": 0.2, "преподаватель": 0.6, "ученый": 0.3, "учёный": 0.3, "научный сотрудник": 0.6, "руководитель": 0.5, "инженер-проектировщик": 0.8, "проектировщик": 0.4, "эксперт": 0.6, "безопасности": 0.7, "охрана": 0.7},
        "12.03.01 Приборостроение": {"электрик": 0.8, "механик": 0.5, "электроника": 0.8, "приборы": 0.8, "измерения": 0.8, "аналитик": 0.2, "программист": 0.3, "разработчик": 0.2},
        "13.03.02 Электроэнергетика и электротехника": {"механик": 0.5, "электрик": 0.8, "энергетик": 0.7, "инженер-проектировщик": 0.7, "инженер": 0.5, "проектировщик": 0.2, "руководитель": 0.2, "технолог": 0.5},
        "27.03.04 Управление в технических системах": {"механик": 0.6, "инженер-исследователь": 0.8, "инженер": 0.6, "исследователь": 0.2, "учёный": 0.3, "ученый": 0.3, "научный сотрудник": 0.6, "руководитель": 0.5, "инженер-проектировщик": 0.8, "проектировщик": 0.4},
        "09.03.01 Информатика и вычислительная техника": {"программист": 1, "разработчик": 0.5, "руководитель": 0.3, "менеджер": 0.6, "моделист": 0.3, "математик": 0.3, "системный инженер": 0.7, "системный администратор": 0.7, "ПО": 0.7, "специалист": 0.3, "бизнес-аналитик": 0.7, "аналитик": 0.6, "бизнес": 0.1, "инженер-консультат": 0.5, "инженер": 0.4, "консультант": 0.1, "инженер-проектировщик": 0.6, "проектировщик": 0.2},
        "01.03.04 Прикладная математика": {"математик": 1, "моделист": 0.9, "инженер": 0.4, "исследователь": 0.2, "учёный": 0.5, "ученый": 0.5, "научный сотрудник": 0.7, "инженер-проектировщик": 0.8},
        "18.03.01 Химическая технология": {"химик": 1, "лаборант": 0.9, "технолог": 0.6, "cпециалист": 0.5, "стажер-исследователь": 0.6, "научный сотрудник": 0.6, "учёный": 0.5},
        "18.03.02 Энерго- и ресурсосберегающие процессы в химической технологии, нефтехимии и биотехнологии": {"эколог": 1, "технолог": 0.6, "химик": 1, "лаборант": 0.9, "cпециалист": 0.5, "стажер-исследователь": 0.6, "научный сотрудник": 0.6, "учёный": 0.5},
        "38.03.01 Экономика": {"экономист": 1, "cтратег": 0.8, "партнёр": 0.6, "партнер": 0.6, "агент": 0.5},
        "38.03.02 Менеджмент": {"менеджер": 1, "бизнесмен": 0.6, "аналитик": 0.6, "экономист": 0.6, "cтратег": 0.6, "партнёр": 0.5, "партнер": 0.5, "агент": 0.4},
        "10.03.01 Информационная безопасность": {"ит": 0.6, "it": 0.6, "ИБ": 1, "специалист": 0.6, "ИБ-специалист": 1, "иб-специалист": 1, "ит-специалист": 0.6},
        "40.03.01 Юриспруденция": {"юрист": 1, "правовед": 0.8, "эколог": 0.2},
        "38.03.05 Бизнес-информатика": {"бизнесмен": 1, "аналитик": 1, "ИТ": 0.6, "IT": 0.6, "ит": 0.6, "it": 0.6, "руководитель": 0.2, "программист": 0.1},
        "41.03.05 Международные отношения": {"аналитик": 0.8, "чиновник": 0.8, "переговорщик": 0.8, "переводчик": 0.6}
        }


def check_subject(prog: str, received_ege: list[str]) -> bool:
    ...


def without(massive: list[str], word: str) -> list[str]:
    for i in range(len(massive)):
        if massive[i] == word:
            del massive[i]
            break
    return massive

def check_ege(string: str) -> int:
    string = string.lower().strip().split()
    print(f"[INFO] {string}")
    sub = string[0][:3]
    if sub not in rus_subj.keys():
        return 0
    if sub in list(rus_subj.keys()):
        try:
            a = int(string[-1])
        except Exception:
            print(f"[INFO] {string[-1]}")
            return 0
        if a > 100:
            print(f"[INFO] {a}")
            return 4
        elif 0 <= a < rus_subj[sub][0]:
            print(f"[INFO] {a}")
            return 3
        elif a < 0:
            print(f"[INFO] {a}")
            return 2
        else:
            print(f"[INFO] {sub}")
            return 1
    print(f"[INFO] {sub}")
    return 0

def get_recommend(naprav: str, jobs: list[str]) -> bool:
    if len(jobs) == 0:
        return True
    S = 0
    for i in jobs:
        S += jobs_dict[naprav].get(i, 0)
    if S >= (len(jobs)*0.2):
        return True
    return False
